{
	"weapons": [
		{
			"className": "Electroscythe",
			"name": "Electroscythe",
			"imagePath": "electroscythe",
			"price": [
				"BLUE_AMMO"
			],
			"description": "Basic mode: Deal 1 damage to every other player non your square.\nIn reaper mode: Deal 2 damage to every other player on your square.",
			"secondaryPrice": [
				"BLUE_AMMO",
				"RED_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 2,
			"secondaryMarks": 0
		},
		{
			"className": "MachineGun",
			"name": "Machine Gun",
			"imagePath": "machine_gun",
			"price": [
				"BLUE_AMMO",
				"RED_AMMO"
			],
			"description": "Basic effect: Choose 1 or 2 targets you can see and deal 1 damage to each.\nWith focus shot: Deal 1 additional damage to one of those targets.\nWith turret tripod: Deal 1 additional damage to the other of those targets and/or deal 1 damage to a different target you can see.\nNotes: If you deal both additional points of damage, they must be dealt to 2 different targets. If you see only\n2 targets, you deal 2 to each if you use both optional effects. If you use the basic effect on only 1 target, you can still use the the turret tripod to give it 1 additional damage.",
			"optionalPrices": [
				"YELLOW_AMMO",
				"BLUE_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"optional1Marks": 0,
			"optional1Damage": 1,
			"optional2Marks": 0,
			"optional2Damage": 1,
			"optional2ExtraDamage": 1
		},
		{
			"className": "TractorBeam",
			"name": "Tractor Beam",
			"imagePath": "tractor_beam",
			"price": [
				"BLUE_AMMO"
			],
			"description": "Basic mode: Move a target 0, 1, or 2 squares to a square you can see, and give it 1 damage.\nIn punisher mode: Choose a target 0, 1, or 2 moves away from you. Move the target to your square and deal 3 damage to it.\nNotes: You can move a target even if you can't see it. The target ends up in a place where you can see and damage it. The moves do not have to be in the same direction.",
			"secondaryPrice": [
				"RED_AMMO",
				"YELLOW_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 3,
			"secondaryMarks": 0
		},
		{
			"className": "Thor",
			"name": "T.H.O.R.",
			"imagePath": "thor",
			"price": [
				"BLUE_AMMO",
				"RED_AMMO"
			],
			"description": "Basic effect: Deal 2 damage to 1 target you can see.\nWith chain reaction: Deal 1 damage to a second target that your first target can see.\nWith high voltage: Deal 2 damage to a third target that your second target can see. You cannot use this effect unless you first use the chain reaction.\nNotes: This card constrains the order in which you can use its effects. (Most cards don't.) Also note that each target must be a different player.",
			"optionalPrices": [
				"BLUE_AMMO",
				"BLUE_AMMO"
			],
			"primaryDamage": 2,
			"primaryMarks": 0,
			"moveDistance": 0,
			"optional1Marks": 0,
			"optional1Damage": 1,
			"optional2Marks": 0,
			"optional2Damage": 2
		},
		{
			"className": "Whisper",
			"name": "Whisper",
			"imagePath": "whisper",
			"price": [
				"BLUE_AMMO",
				"BLUE_AMMO",
				"YELLOW_AMMO"
			],
			"description": "Effect: Deal 3 damage and 1 mark to 1 target you can see. Your target must be at least 2 moves away from you.\nNotes: For example, in the 2-by-2 room, you cannot shoot a target on an adjacent square, but you can shoot a target on the diagonal. If you are beside a door, you can't shoot a target on the other side of the door, but you can shoot a target on a different square of that room.",
			"primaryDamage": 3,
			"primaryMarks": 1,
			"moveDistance": 0
		},
		{
			"className": "VortexCannon",
			"name": "Vortex Cannon",
			"imagePath": "vortex_cannon",
			"price": [
				"RED_AMMO",
				"BLUE_AMMO"
			],
			"description": "Basic effect: Choose a square you can see, but not your square. Call it \"the vortex\". Choose a target on the vortex or 1 move away from it. Move it onto the vortex and give it 2 damage.\nWith black hole: Choose up to 2 other targets on the vortex or 1 move away from it. Move them onto the vortex and give them each 1 damage.\nNotes: The 3 targets must be different, but some might start on the same square. It is legal to choose targets on your square, on the vortex, or even on squares you can't see. They all end up on the vortex.",
			"optionalPrices": [
				"RED_AMMO"
			],
			"primaryDamage": 2,
			"primaryMarks": 0,
			"moveDistance": 0,
			"optional1Marks": 0,
			"optional1Damage": 1,
			"optional2Marks": 0,
			"optional2Damage": 0
		},
		{
			"className": "Furnace",
			"name": "Furnace",
			"imagePath": "furnace",
			"price": [
				"RED_AMMO",
				"BLUE_AMMO"
			],
			"description": "Basic mode: Choose a room you can see, but not the room you are in. Deal 1 damage to everyone in that room.\nIn cozy fire mode: Choose a square exactly one move away. Deal 1 damage and 1 mark to everyone on that square.",
			"secondaryPrice": [],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 1,
			"secondaryMarks": 1
		},
		{
			"className": "Heatseeker",
			"name": "Heatseeker",
			"imagePath": "heatseeker",
			"price": [
				"RED_AMMO",
				"RED_AMMO",
				"YELLOW_AMMO"
			],
			"description": "effect: Choose 1 target you cannot see and deal 3 damage to it.\nNotes: Yes, this can only hit targets you cannot see.",
			"primaryDamage": 3,
			"primaryMarks": 0,
			"moveDistance": 0
		},
		{
			"className": "Hellion",
			"name": "Hellion",
			"imagePath": "hellion",
			"price": [
				"RED_AMMO",
				"YELLOW_AMMO"
			],
			"description": "Basic mode: Deal 1 damage to 1 target you can see at least 1 move away. Then give 1 mark to that target and everyone else on that square.\nIn nano-tracer mode: Deal 1 damage to 1 target you can see at least 1 move away. Then give 2 marks to that target and everyone else on that square.",
			"secondaryPrice": [
				"RED_AMMO"
			],
			"primaryMarks": 1,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 1,
			"secondaryMarks": 2,
			"primaryFollowingDamage": 0,
			"primaryFollowingMarks": 1,
			"secondaryFollowingDamage": 0,
			"secondaryFollowingMarks": 2
		},
		{
			"className": "Flamethrower",
			"name": "Flamethrower",
			"imagePath": "flamethrower",
			"price": [
				"RED_AMMO"
			],
			"description": "Basic mode: Choose a square 1 move away and possibly a second square 1 more move away in the same direction. On each square, you may choose 1 target and give it 1 damage.\nIn barbecue mode: Choose 2 squares as above. Deal 2 damage to everyone on the first square and 1 damage to everyone on the second square.\nNotes: This weapon cannot damage anyone in your square. However, it can sometimes damage a target you can't see – the flame won't go through walls, but it will go through doors. Think of it as a straight-line blast of flame that can travel 2 squares in a cardinal direction.",
			"secondaryPrice": [
				"YELLOW_AMMO",
				"YELLOW_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 2,
			"secondaryMarks": 0,
			"secondaryFollowingDamage": 1,
			"secondaryFollowingMarks": 0
		},
		{
			"className": "ZX_2",
			"name": "ZX-2",
			"imagePath": "zx-2",
			"price": [
				"YELLOW_AMMO",
				"RED_AMMO"
			],
			"description": "Basic mode: Deal 1 damage and 2 marks to 1 target you can see.\nIn scanner mode: Choose up to 3 targets you can see and deal 1 mark to each.\nNotes: Remember that the 3 targets can be in 3 different rooms.",
			"secondaryPrice": [],
			"primaryMarks": 2,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 0,
			"secondaryMarks": 1
		},
		{
			"className": "Shotgun",
			"name": "Shotgun",
			"imagePath": "shotgun",
			"price": [
				"YELLOW_AMMO",
				"YELLOW_AMMO"
			],
			"description": "Basic mode: Deal 3 damage to 1 target on your square. If you want, you may then move the target 1 square.\nIn long barrel mode: Deal 2 damage to 1 target on any square exactly one move away.",
			"secondaryPrice": [],
			"primaryMarks": 0,
			"primaryDamage": 3,
			"moveDistance": 0,
			"secondaryDamage": 2,
			"secondaryMarks": 0
		},
		{
			"className": "Railgun",
			"name": "Railgun",
			"imagePath": "railgun",
			"price": [
				"YELLOW_AMMO",
				"YELLOW_AMMO",
				"BLUE_AMMO"
			],
			"description": "Basic mode: Choose a cardinal direction and 1 target in that direction. Deal 3 damage to it.\nIn piercing mode: Choose a cardinal direction and 1 or 2 targets in that direction. Deal 2 damage to each.\nNotes: Basically, you're shooting in a straight line and ignoring walls. You don't have to pick a target on the other side of a wall – it could even be someone on your own square – but shooting through walls sure is fun. There are only 4 cardinal directions. You imagine facing one wall or door, square-on, and firing in that direction. Anyone on a square in that direction (including yours) is a valid target. In piercing mode, the 2 targets can be on the same square or on different squares.",
			"secondaryPrice": [],
			"primaryMarks": 0,
			"primaryDamage": 3,
			"moveDistance": 0,
          "secondaryDamage": 2,
			"secondaryMarks": 0
		},
		{
			"className": "Shockwave",
			"name": "Shockwave",
			"imagePath": "shockwave",
			"price": [
				"YELLOW_AMMO"
			],
			"description": "Basic mode: Choose up to 3 targets on different squares, each exactly 1 move away. Deal 1 damage to each target.\nIn tsunami mode: Deal 1 damage to all targets that are exactly 1 move away.",
			"secondaryPrice": [
				"YELLOW_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 1,
			"moveDistance": 0,
			"secondaryDamage": 1,
			"secondaryMarks": 0
		},
		{
			"className": "Sledgehammer",
			"name": "Sledgehammer",
			"imagePath": "sledgehammer",
			"price": [
				"YELLOW_AMMO"
			],
			"description": "Basic mode: Deal 2 damage to 1 target on your square.\nIn pulverize mode: Deal 3 damage to 1 target on your square, then move that target 0, 1, or 2 squares in one direction.\nNotes: Remember that moves go through doors, but not walls.",
			"secondaryPrice": [
				"RED_AMMO"
			],
			"primaryMarks": 0,
			"primaryDamage": 2,
			"moveDistance": 0,
			"secondaryDamage": 3,
			"secondaryMarks": 0
		}
	]
}